#include<iostream>
using namespace std;

int main(){
    int number;
    printf("Введите номер региона: ");
    wcin >> number;
    switch (number)
    {
        case 1:
            printf("Это код для г. Астана");
            break;
        case 2:
            printf("Это код для г. Алматы.");
            break;
        case 3:
            printf("Акмолинская область.\n1. Акколь;\n2. Щучинск;\n3. Егиндыколь;\n4. Кокшетау.");
            break;
        case 4:
            printf("Актюбинская область.\n1. Алга;\n2. Актобе;\n3. Хромтау;\n4. Шалкар.");
            break;
        case 5:
            printf("Алматинская область.\n1. Баканас;\n2. Есик;\n3. Узынагаш;\n4. Талгар.");
            break;
        case 6:
            printf("Атырауская область.\n1. Атырау;\n2. Кульсары;\n3. Курмангазы;\n4. Макат.");
            break;
        case 7:
            printf("Западно-Казахстанская область.\n1. Уральск;\n2. Чапаев;\n3. Жангала;\n4. Жанибек.");
            break;
        case 8:
            printf("Жамбылская область.\n1. Тараз;\n2. Аса;\n3. Мойынкум;\n4. Кордай.");
            break;
        case 9:
            printf("Карагандинская область.\n1. АБАЙ;\n2. Караганда;\n3. шахтинск;\n4. Сарань.");
            break;
        }
}